{"keras_version": "2.0.4", "class_name": "Model", "backend": "theano", "config": {"output_layers": [["merged", 0, 0]], "name": "model_1", "layers": [{"name": "inputs", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "inputs", "batch_input_shape": [null, 32, 90, 3]}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1", "use_bias": true, "kernel_regularizer": null, "kernel_size": [5, 5], "filters": 32}, "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"name": "relu1", "class_name": "Activation", "config": {"activation": "relu", "name": "relu1", "trainable": true}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2", "use_bias": true, "kernel_regularizer": null, "kernel_size": [5, 5], "filters": 64}, "inbound_nodes": [[["relu1", 0, 0, {}]]]}, {"name": "relu2", "class_name": "Activation", "config": {"activation": "relu", "name": "relu2", "trainable": true}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "pool2", "class_name": "MaxPooling2D", "config": {"padding": "same", "pool_size": [2, 2], "trainable": true, "name": "pool2", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["relu2", 0, 0, {}]]]}, {"name": "conv3", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv3", "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 128}, "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"name": "relu3", "class_name": "Activation", "config": {"activation": "relu", "name": "relu3", "trainable": true}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "pool3", "class_name": "AveragePooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "pool3", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["relu3", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"name": "fc1", "class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "fc1", "units": 57}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dropout1", "class_name": "Dropout", "config": {"name": "dropout1", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "fc21", "class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "fc21", "units": 57}, "inbound_nodes": [[["dropout1", 0, 0, {}]]]}, {"name": "fc22", "class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "fc22", "units": 57}, "inbound_nodes": [[["dropout1", 0, 0, {}]]]}, {"name": "fc23", "class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "fc23", "units": 57}, "inbound_nodes": [[["dropout1", 0, 0, {}]]]}, {"name": "fc24", "class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "fc24", "units": 57}, "inbound_nodes": [[["dropout1", 0, 0, {}]]]}, {"name": "merged", "class_name": "Merge", "config": {"dot_axes": -1, "output_shape": null, "mode_type": "raw", "mode": "concat", "output_mask_type": "raw", "name": "merged", "concat_axis": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null}, "inbound_nodes": [[["fc21", 0, 0, {"mask": [null, null, null, null]}], ["fc22", 0, 0, {"mask": [null, null, null, null]}], ["fc23", 0, 0, {"mask": [null, null, null, null]}], ["fc24", 0, 0, {"mask": [null, null, null, null]}]]]}], "input_layers": [["inputs", 0, 0]]}}